{"0": [" 5 out of 5 I like it Is so good 02-09-2022 by Shom Gabriel Verified Purchase 5 out of 5 Nice Works fine 01-09-2022 by Olaoluwa Verified Purchase 4 out of 5 Impressed It's a very good product with commendable sound quality 01-09-2022 by S A M S O N Verified Purchase 5 out of 5 Excited! It sounds good, excellent product. . . I love it 31-08-2022 by Alasa Verified Purchase 4 out of 5 Good product The product is very ok. . 29-08-2022 by G A B R I E L Verified Purchase 5 out of 5 I love it Omo! The sound quality is amazing. . . . 29-08-2022 by Michael Verified Purchase 5 out of 5good The product is legit and good 29-08-2022 by Utibe Verified Purchase 2 out of 5 Didn't sound clear. Has no promote either. Its just basic. 29-08-2022 by Sam Ajayi Verified Purchase 5 out of 5 I like it It's very okay 26-08-2022 by Florence Verified Purchase 5 out of 5 Same as described Love the sound quality 25-08-2022 by Julius Verified Purchase"], "1": [" 5 out of 5 I love it Am giving it 5 star ⭐️ joor 25-08-2022 by Kenny Aluko H A Y A A T Verified Purchase 4 out of 5 Great and good sound Make the speakers little bigger than it is now. ", "The Bluetooth connection often breaks while playing and its distance is just within a self contain apartment. ", "", "It should have a remote for control not going down there to change or pause or next a song if played with a flash drive. 23-08-2022 by Pascal Verified Purchase 5 out of 5 Awesome product Wow. The speaker is lit. If you're looking for an exclusively indoor product to give you the best sound experience, then search no longer. Currently enjoying it 22-08-2022 by Samuel Verified Purchase 5 out of 5 Recommended Good for the price 22-08-2022 by Famzy Verified Purchase 3 out of 5remote Try add a remote to it and it is good to go 22-08-2022 by Yusuf Verified Purchase 3 out of 5 I like it Connecting to the T V is not as simple as abcd 19-08-2022 by ajibola Verified Purchase 3 out of 5improve on it Could be better 18-08-2022 by B R I A N Verified Purchase 5 out of 5 I'M S O I M P R E S S E D I can guarantee you that you will never regret buying this. I did my research on You Tube before buying this boy, this is so great i feel the price may increase soon maybe they are trying to make the product popular. This sound system is worth 100k 17-08-2022 by G A B Verified Purchase 5 out of 5 Good deal The unit is well crafted and the sound production is top notch 15-08-2022 by Samuel Arukwe Verified Purchase 5 out of 5 Good Working perfect 10-08-2022 by Lateef Verified Purchase"], "2": [" 5 out of 5 Nice one Impressive sound quality. The quick connectivity to both the Bluetooth and U S B is another plus, thanks but I hope it's durable; something to enjoy for a long time. 08-08-2022 by Felix Verified Purchase 5 out of 5 Excellent All features are working perfectly 08-08-2022 by Femi Verified Purchase 4 out of 5 I like it The product is okay. It meets my expectation. 08-08-2022 by Kingsley Verified Purchase 5 out of 5 Love it As small but big bass, wow, I am digging the vibe, lolz 08-08-2022 by Adeniyi Verified Purchase 4 out of 5 It's nice It's sound production is topnotch 02-08-2022 by Francis Verified Purchase 5 out of 5 I love it I love everything about it 02-08-2022 by Adebisi Verified Purchase 5 out of 5 Correct One I love it 01-08-2022 by Aliyu Verified Purchase 5 out of 5 Nice product Nice product but no remote control 01-08-2022 by Edirin Verified Purchase 5 out of 5 I like it Is awesome 30-07-2022 by Dozlink Verified Purchase 4 out of 5 Great Deal It is a nice product. It is exactly as it was described. . . 30-07-2022 by Ridwan Verified Purchase"], "3": [" 5 out of 5 Cool The sound is really great. You won't regret buying 27-07-2022 by Kayode Verified Purchase 5 out of 5good product Very Good 26-07-2022 by Haruna Verified Purchase 5 out of 5 It’s top notch The speaker is small but mighty. It’s perfect for a mid sized apartment. The output is so clear and it pairs with my phone fast. 25-07-2022 by Oluwatosin Verified Purchase 5 out of 5great productgenerally, the sound quality is great 25-07-2022 by Ayomide Verified Purchase 5 out of 5 Impressed It's a great product for its worth ", "Great sound quality and Portable ", "The only issue is that it doesn't have a remote. 25-07-2022 by V I C T O R Verified Purchase 5 out of 5 Good sound I love the product. . . small body big engine 22-07-2022 by Akpos R Verified Purchase 5 out of 5 Great product It's a nice product just as seen in the picture, small but mighty in sound output. 21-07-2022 by Emmykay Verified Purchase 4 out of 5 Very good and beautiful It okay and very easy to connect, i wonder why many comment i read b4 buying this says it not connecting to thier tv. 2. I gave it 4 stars because it need remote and the volume should be increase. Its okay for indoor use only as indicated. Small, mighty n portable thank God my hubby like my choice. 21-07-2022 by Morenike Verified Purchase 4 out of 5 Very good and beautiful It okay and very easy to connect, i wonder why many comment i read b4 buying this says it not connecting to thier tv. 2. I gave it 4 stars because it need remote and the volume should be increase. Its okay for indoor use only as indicated. Small, mighty n portable thank God my hubby like my choice. 21-07-2022 by Morenike Verified Purchase 5 out of 5 Edifier multimedia speakers I love this product so much. This is actually the second I'm getting cause the first I bought is serving me well at home so I got a second for my studio. It's perfect. Light weight and very portable with a perfect sound system 21-07-2022 by Patty Verified Purchase"], "4": [" 5 out of 5 Amazing sound at a budget price Had my doubts about it till I bought it and now I'm really glad I did. I don't think you can get a better deal for a sound system at this price 20-07-2022 by Minkababz Verified Purchase 4 out of 5 Good Product Very good for the price. I connected it on my D Stv decoder and I love it. Though it more louder when connected on Bluetooth. For those finding it difficult to connect to decoder/tv please watch the video online see how you can navigate your way through. ", "I would have given it a 5 ? ? but the volume is a no for me. ", "I recommend for those on a very tight budget. 19-07-2022 by Prosper Verified Purchase 5 out of 5 I Like it Good sound quality 19-07-2022 by Sheriff Verified Purchase 4 out of 5 I like it It's okay as prescribed. 19-07-2022 by Abdul-azeez Verified Purchase 5 out of 5is amazing The bass is okay 19-07-2022 by ozioma Verified Purchase 5 out of 5 I like itlovely sound for an enclosed place. Worth the buy. 19-07-2022 by Gloria Verified Purchase 5 out of 5i like it De bazz is ok + volume just that u can't connect it to a T V 18-07-2022 by Jeremiah Verified Purchase 5 out of 5i like it De bazz is ok + volume just that u can't connect it to a T V 18-07-2022 by Jeremiah Verified Purchase 5 out of 5 Like The bass is crazy ", "For that amount 18-07-2022 by Kelvin Verified Purchase 4 out of 5 I like the product ? ? ? ? ? The sound work perfect ? . . . 18-07-2022 by Fkunmie Verified Purchase"], "5": [" 5 out of 5 My best buy Loving and enjoying everything about this speakers, sound output is so cool 18-07-2022 by Benita Verified Purchase 5 out of 5 Good Buy Sound production is good, and delivered just as expected. 18-07-2022 by Ever Verified Purchase 5 out of 5sound quality I really love it. . The sound is superb as expected. 15-07-2022 by Paul Verified Purchase 5 out of 5 Awesome Sounds so good and everything works perfectly 14-07-2022 by Austin Verified Purchase 3 out of 5 No B T connectivity The sound is good but no Bluetooth connectivity as claimed. 14-07-2022 by S H O L A Verified Purchase 5 out of 5 Super Edifier Exactly what i needed in my room, so good for the price, i love it immediately on connection. 14-07-2022 by yomi Verified Purchase 2 out of 5not bad I like the item but unable to connect to my tv. . . . . fail my expectations 13-07-2022 by Olufayo Verified Purchase 4 out of 5 Not bad for the money The bass are good. Talk about small body big engine 13-07-2022 by David Verified Purchase 5 out of 5 Great Bass The sound is waooo 13-07-2022 by tunde Verified Purchase 5 out of 5 Verified It's very nice, I love it? ? 11-07-2022 by Morezii Verified Purchase"], "6": [" 5 out of 5 Fantastic Very wonderful product, I'm recommending this for anyone who needs  a standard home theatre. The price is just too good for the product. ", "I love it 11-07-2022 by Louis Verified Purchase 5 out of 5 Smart I like it 11-07-2022 by Prince Verified Purchase 5 out of 5 Love it The sound is good and low energy consumption. Could even play it with my M T N Lumos when there is power outage 11-07-2022 by Paul Verified Purchase 4 out of 5 I like it I love the sound quality. It would have just been better if it had a mini remote control. . 11-07-2022 by I D O W U Verified Purchase 5 out of 5superb speakers Awesome bluetooth speakers ", "Cool bass and easy connection", "It ok for the price 08-07-2022 by Samuel Nathie Verified Purchase 5 out of 5powerful product. . The sound production and capacity is out of this world for small subwoofer like this. . 08-07-2022 by David Verified Purchase 5 out of 5 The sound Just as displayed 08-07-2022 by Jacob Verified Purchase 5 out of 5it's ok for the price Every tin about it i like it 07-07-2022 by Abdullahi Verified Purchase 5 out of 5 Amazing Product Awesome features all in a good amount. .  love it so much for the Bluetooth press and hold the volume bottom to switch to Bluetooth simple 06-07-2022 by Anyile Verified Purchase 4 out of 5 Very Okay Beat my expectations. . . . . 05-07-2022 by Heyday Verified Purchase"], "7": [" 5 out of 5edifier Is so lovely i really like it but know Bluetooth 05-07-2022 by Olamiposi Verified Purchase 4 out of 5good product Very good. Thought it had radio or mscard slot or can allow extra speaker 01-07-2022 by Dare Verified Purchase 5 out of 5i like it All about it 01-07-2022 by Obidairo Verified Purchase 5 out of 5 Quality product What I ordered is what I got 29-06-2022 by Olamoyegun Abdulkareeem Verified Purchase 4 out of 5 Nice speakers Medium sized speakers with very rich sounds 29-06-2022 by Julius Verified Purchase 5 out of 5 Superb sound, I love it. Just what I needed at the moment 28-06-2022 by Martins Verified Purchase 4 out of 5edifier Nice product 28-06-2022 by Ayomide Verified Purchase 5 out of 5 Love it! Just what I needed for the house 28-06-2022 by O S E M E K E Verified Purchase 5 out of 5 Nice Speakers At first I thought it was small but after connecting the speakers. . . That was when I E D I F I E R was called Small body big engine by my niece. Nice product 27-06-2022 by Thank God Verified Purchase 5 out of 5good sound Really enjoying it 27-06-2022 by Samford Verified Purchase"], "8": [" 5 out of 5 Very portable Portable and very good sound 27-06-2022 by H A R L I H M A R T Verified Purchase 5 out of 5 Quality Product The Bass Quality is good 27-06-2022 by Ifeoluwa Verified Purchase 5 out of 5 I like it Well still ok for only indoor, but not ok for an outdoor seating 27-06-2022 by Francis Verified Purchase 4 out of 5cool Not too loud, but manageable. 22-06-2022 by Midastouchbui Verified Purchase 5 out of 5 Very nice. It is a very very good product. I strongly recommend. 20-06-2022 by Veejay Sheriff Verified Purchase 3 out of 5 Nice Best good 20-06-2022 by Idris Riwdan Verified Purchase 5 out of 5 Small but mighty I really love the sound and it’s a good quality 20-06-2022 by Agbeleoba Igbekele Verified Purchase 4 out of 5 Ok for its price Sound quality good, but expected more bass 20-06-2022 by Obidozie Jude Verified Purchase 5 out of 5 Good It's awesome. For the price and size. 20-06-2022 by ken chuks check youtube Verified Purchase 5 out of 5 Perfect A lot better than it looks 20-06-2022 by Samuel Anthony Verified Purchase"], "9": [" 5 out of 5 Awesome Perfecto 16-06-2022 by David Odion Verified Purchase 5 out of 5 Love it! Really nice bass, not exactly made for parties tho, but if you’re looking for solid speakers for a room, then yea this is a great buy. 14-06-2022 by Alex Verified Purchase 5 out of 5? Top notch ? ? 13-06-2022 by Sokefun Olamide Joshua Verified Purchase 3 out of 5rating100% sound and nice 09-06-2022 by Chimaco Global Verified Purchase 3 out of 5sound is cool Cool sound but no bluetooth 09-06-2022 by O N O Seh Verified Purchase 4 out of 5 Like it No issue and the sound is okay, but you can do well to add remote to it. 06-06-2022 by M I C H A E L A D E B A Y O Verified Purchase 5 out of 5affordable Decent sound quality, well built. Bass is not that great but I think it is the best that can be produced by subwoofer of that size. 03-06-2022 by Roy Verified Purchase 5 out of 5mr Good thinking good product 02-06-2022 by Ben Gift Verified Purchase 5 out of 5 Good Great sound. I recommend 01-06-2022 by Ibuo Verified Purchase 4 out of 5nice Wish it came with a remote though 30-05-2022 by Andrew Verified Purchase"], "10": [" 5 out of 5good product I love the sound and connections very easy 30-05-2022 by O L A M I D E Verified Purchase 5 out of 5 Awesome Speaker The sound is Clean and nice. ", "The downside is there's no remote but you should hear the sound from this little speaker. 29-05-2022 by Shady Verified Purchase 5 out of 5wonderful The sound make sense for the price. It worth it. 27-05-2022 by Aborisade Verified Purchase 4 out of 5i like it It's sound as expected 27-05-2022 by Odemakinde Verified Purchase 4 out of 5 I like it it's awesome and beautiful The product is good trust me go for it 27-05-2022 by uzuh Verified Purchase 4 out of 5good It gives quality sound 26-05-2022 by Toheeb Verified Purchase 5 out of 5 I like it The product its very nice 23-05-2022 by Sadiq Verified Purchase 3 out of 5 Nice It’s nice but no remote control 20-05-2022 by Hakeem Sodimu Verified Purchase 5 out of 5 Great sound Love it! 18-05-2022 by Andrew John Verified Purchase 5 out of 5 Really nice This is my second time buying this, this time for a friend, he loves it 17-05-2022 by Samuel Verified Purchase"], "11": [" 5 out of 5 The speaker was so good Small but extra mighty 16-05-2022 by Ademola Olamilekan Verified Purchase 5 out of 5 I love it? ? really cool 16-05-2022 by Mary Anne Verified Purchase 3 out of 5 Basic review Mainly good for indoors, but considerably ok. 13-05-2022 by O L A D E L E A B I O D U N M I C H E A L L J-force Verified Purchase 5 out of 5 Is really perfect I like it and really enjoy it 13-05-2022 by Adegboye Oluwaseun Verified Purchase 4 out of 5 Top performance I am enjoying the machine. No regrets at all 12-05-2022 by J O H N Verified Purchase 5 out of 5 I like it Superb, I love it. 09-05-2022 by H O W A R D Verified Purchase 5 out of 5lovely sound The product should have a remote for ease of control 09-05-2022 by Olugbenga Verified Purchase 5 out of 5 Simple and soft Not suitable for parties but very good for a room 09-05-2022 by A B Verified Purchase 5 out of 5 Good Stuff The Sound is Great 09-05-2022 by David Verified Purchase 3 out of 5 I like it Good sound 09-05-2022 by Raji Verified Purchase"], "12": [" 4 out of 5cool speakers Would have been perfect if it had a remote. When I connect to my T V I cannot control the sound anymore except from The speaker. 06-05-2022 by A K E E M Verified Purchase 5 out of 5portable It's a good woofer but not too much loud 06-05-2022 by Abdulsalam Verified Purchase 4 out of 5 Good sound The product is ok 06-05-2022 by Amaka Verified Purchase 1 out of 5 Lovely product I absolutely love it. Well, I wish it had more bass though. And would be nice if it was rechargeable 05-05-2022 by A J A Y I O L A Verified Purchase 5 out of 5good Good product 05-05-2022 by Ogundipe Verified Purchase 5 out of 5it av bass I like it 03-05-2022 by wasiu Verified Purchase 5 out of 5 Awesome Bass. . . . . . it's just awesome for the price I didn't expect to be this good given the price and size 03-05-2022 by Emmanuel Verified Purchase 5 out of 5ok It function well 03-05-2022 by Chukwudi Verified Purchase 5 out of 5 Very good Satisfactory 02-05-2022 by Wale Verified Purchase 3 out of 5 Excellent I love everything about the system. The bass is awesome. Play radio on it via my phone with my ear piece plugged on the phone. 30-04-2022 by Uka Uchechukwu Verified Purchase"], "13": [" 5 out of 5 The speaker is great Nice sounds. . . Doesn't have remote and Radio 29-04-2022 by T A I W O Verified Purchase 5 out of 5 Folorunsho I love the product 29-04-2022 by Folorunsho Verified Purchase 5 out of 5 Small but M I G H T Y You need to hear this little boy blast! ! Don’t let size deceive you, this champion is thick, full of bass and is not ashamed to make noise. Go get yours A S A P. 28-04-2022 by Rowland Verified Purchase 4 out of 5 Nicesound Would have been nice if it had remote and battery backup to use when there's no light. Otherwise very good. 28-04-2022 by Awolusi Verified Purchase 5 out of 5 I love it Got exactly what was expected 27-04-2022 by Adeola Verified Purchase 5 out of 5 Excellent Is good 27-04-2022 by Livingston Smith Verified Purchase 3 out of 5 Like it Loud but no deep bass 26-04-2022 by Yung J Verified Purchase 4 out of 5 Nice sound The sound is wow but please include remote in it 26-04-2022 by Jennifer Oscar Verified Purchase 5 out of 5the bass I love it , it sound well with the bass ? ? 26-04-2022 by Prince adesunshine Verified Purchase 5 out of 5 The best products on jumia Everything about the product is awesome 26-04-2022 by Waheed Odeyinka Verified Purchase"], "14": [" 5 out of 5 Excellent Perfection thanks 25-04-2022 by Ukasha Hassan Verified Purchase 5 out of 5 Love it. Sounds nice 25-04-2022 by Trump Verified Purchase 4 out of 5 I like it Good for it price 25-04-2022 by Odesola Verified Purchase 5 out of 5 Edifier Portable, sleek and powerful 25-04-2022 by Michael Verified Purchase 5 out of 5 Satisfactory This product is very okay, I love the output 22-04-2022 by Abah Jeremiah Verified Purchase 4 out of 5 No regrets You can tune your bass to satisfaction and the  volume is lit, I love it tho. . . very pleased 22-04-2022 by Dominic Verified Purchase 5 out of 5 I like it Nice, loud, does the job 22-04-2022 by Damilola Verified Purchase 4 out of 5 I love it , very nice What a great electronic version, but I wish it could come with mini remote. . . Kudos to ediffer producer 21-04-2022 by J I M O H Y A Q U B Verified Purchase 5 out of 5 Fantastic The bass was wow ? ? omo I like this speaker 21-04-2022 by Ayobami Verified Purchase 5 out of 5 I love it It's awesome, the sound is top notch 21-04-2022 by Temitope Verified Purchase"], "15": [" 3 out of 5is cool Yes is okay 21-04-2022 by B E L L A D O N N A Verified Purchase 5 out of 5perfect Works well, a good buy 21-04-2022 by tim Verified Purchase 5 out of 5perfect Works well, a good buy 21-04-2022 by tim Verified Purchase 4 out of 5 Okay Very good for the price. I just wished F M was included 19-04-2022 by Taiye Verified Purchase 4 out of 5 Cool Nice for a small space setup 19-04-2022 by Kayode Ogungbemi Verified Purchase 5 out of 5 Love it It's working fine, love the sound 18-04-2022 by Ste Verified Purchase 5 out of 5good speaker The Sound is very good 18-04-2022 by Tony Verified Purchase 5 out of 5the base It's owk ", "It's produce good sound 18-04-2022 by Dempsey Verified Purchase 5 out of 5it's sounds well I love  the sound 18-04-2022 by Oyebanji Verified Purchase 5 out of 5awesome Great sounds 18-04-2022 by Abdul Verified Purchase"], "16": [" 5 out of 5edifier The sound", "Ok 18-04-2022 by chibueze Verified Purchase 2 out of 5no av cable for television Add av cable for tv 15-04-2022 by Gwar Verified Purchase 5 out of 5 Excellent Very nice product, beats all expectations for the amount it’s being sold for", "Adding a remote control would be nice 15-04-2022 by Greatness Verified Purchase 4 out of 5make sense It's good for the price but generates little noise 15-04-2022 by T O P E Verified Purchase 5 out of 5 Like it Realm appreciate it exactly what I saw 15-04-2022 by Ismail Verified Purchase 4 out of 5 Very nice Works fine and sound is good. 15-04-2022 by Abimbola Verified Purchase 3 out of 5 It’s good and ok Perfect 15-04-2022 by Oluwasanumi Eko Verified Purchase 5 out of 5very nice oh I would buy it again and again oh. Simple and very efficient 13-04-2022 by N D I D I Verified Purchase 2 out of 5nice Good for the price 13-04-2022 by Ameh Verified Purchase 5 out of 5 Very Portable and easy to operate The volume is not too loud. 12-04-2022 by Silver Verified Purchase"], "17": [" 4 out of 5superb It's a great piece for the amount. The sound coming out is amazing. Thumb up 12-04-2022 by Olusola Verified Purchase 5 out of 5why don't you have a remort control I love the sound ? ? 12-04-2022 by Paul Verified Purchase 5 out of 5 The Best Worth more than its price 12-04-2022 by Michael Verified Purchase 5 out of 5i luv the sound system and the bass The clarity of the sound is so awesome ? ? 12-04-2022 by Shaguolo ogheneokoke blessed Verified Purchase 3 out of 5 I do like it Would have preferred if it also worked without light! 11-04-2022 by D I K E Verified Purchase 5 out of 5 I love it It's sounds great 11-04-2022 by Abimbola Kolawole Verified Purchase 4 out of 5 I like it Very nice sound quality. . . I like it 11-04-2022 by Chinweuba Verified Purchase 5 out of 5 Best buy It’s perfect 11-04-2022 by Precious Ehiosun Verified Purchase 5 out of 5 For that Amount, I like it It came as shown. ", "The only problem is that I thought the connection to speakers was wireless connection but all in all, considering the price I got it, I would say it was money for value 11-04-2022 by Udobassey Verified Purchase 5 out of 5 Very Nice The sound is crazy ? ? 11-04-2022 by John Verified Purchase"], "18": [" 5 out of 5 I like it The product is very good 08-04-2022 by chidi Verified Purchase 3 out of 5it good It is good but the bass is not Ok 08-04-2022 by Wasiu Verified Purchase 4 out of 5 I like it Just wish it comes with remote, then I would have given it a  5 star review 08-04-2022 by Jesse Verified Purchase 5 out of 5 Amazing Product! This M206 B T Sound System is just amazing. . . Audio quality is top notch, bass is deep and intense especially for its size although no F M or remote control, I reckon its however a great purchase and value for money. If you're giving it a second thought before buying. . . Just quit thinking and go for it! ! 08-04-2022 by E-C O L L I N S Verified Purchase 5 out of 5 I Love It Its Nice and Sounding good. . . . Thanks 08-04-2022 by Dumebi Verified Purchase 5 out of 5 Nice Nice one 07-04-2022 by Akhimien Esene Verified Purchase 5 out of 5 I love it The. Speaker is loud and the bass is something else. The only thing missing for me is that it's not rechargeable speaker. Nice one 07-04-2022 by A B I O L A Verified Purchase 5 out of 5 Nice sound system I like this system so much. I am using it as gift to my love one. Veey recommendable. 07-04-2022 by chibuisi Verified Purchase 5 out of 5 Good edifier It gives good sound i love it 06-04-2022 by Rasaq Ibrahim Verified Purchase 5 out of 5 I like it Produces a good sound 06-04-2022 by Eni Verified Purchase"], "19": [" 5 out of 5? Budget friendly speaker. Suitable for a simple workspace 05-04-2022 by Oghenemaro Verified Purchase 4 out of 5love it Great product! A remote control for the U S B operations would have made it off the hook! Great low range, wish the high has a control knob like the bass, but it's okay The beautiful wood casing for both the sub and satellite speakers, nailed it! For the Jumia price, less than N20 K, i would recommend it to A N Y O N E 05-04-2022 by A I G B I R I O R Verified Purchase 4 out of 5its very loud Really nice product, i just feel the bass could be alittle more but it's really cool for the price and good 05-04-2022 by M I C H E A L Verified Purchase 5 out of 5 The sound is superb. . . . but I hoped it will last The bass 04-04-2022 by Medinat Verified Purchase 4 out of 5 Needs a remote100% loving it 04-04-2022 by c Ris. Tian Verified Purchase 5 out of 5the bass is ok I like the product good for the price and I hope it last 01-04-2022 by Akinnuwesi Verified Purchase 5 out of 5 Review It’s very okay for the price 01-04-2022 by Oluwaseun Verified Purchase 5 out of 5 Awesome Totally worth it. . . Sound more than what I expected 31-03-2022 by W A H A B Verified Purchase 3 out of 5 Fair in Performance The Volume is not as loud as I expected, So also is the B A S S output. ", "Just meant to fill a tiny room with it sound. 30-03-2022 by Uno Verified Purchase 4 out of 5it should have remote control Awesome device. . I love it 29-03-2022 by Olusegun Sunday Verified Purchase"], "20": [" 5 out of 5 A good product for its price Very okay and nice product. Good sound for your simple environment 29-03-2022 by Benjamin Verified Purchase 5 out of 5 Ok Sounds good 29-03-2022 by Believe Verified Purchase 5 out of 5its perfect Loud and nice, but for bluetooth only 28-03-2022 by Shakur Verified Purchase 5 out of 5 Nice product It's exactly what I was expecting, and it's recommendable if you're using it in a room apartment 28-03-2022 by Ajayi Verified Purchase 5 out of 5good Fast delivery and the product is wow 28-03-2022 by Eazi cut Verified Purchase 5 out of 5 Ok Ok and nice 28-03-2022 by Afees Rasaq Verified Purchase 4 out of 5very ok I like it 28-03-2022 by Frank Verified Purchase 3 out of 5good Good product 28-03-2022 by Adewole Verified Purchase 5 out of 5 Its perfect Go for it guys 25-03-2022 by T H O M P S O N Verified Purchase 5 out of 5it ok Very good 25-03-2022 by K A Z E E M Verified Purchase"], "21": [" 4 out of 5nice Love the sound 25-03-2022 by Hoomlong Verified Purchase 4 out of 5 I like it Is nice  but the size is somehow small 25-03-2022 by Chinyere Verified Purchase 5 out of 5 Nice product Recommend for purchase. 24-03-2022 by Ishaq Abdulrasaq Verified Purchase 5 out of 5 Wonderful Very nice 24-03-2022 by Sarah Alexa Verified Purchase 5 out of 5edifier m206bt It has a very good sounds 22-03-2022 by Victor Verified Purchase 4 out of 5 Yeah It’s okay 22-03-2022 by Nnanyelugo Joseph Verified Purchase 5 out of 5 I like it Very lovely, and sounds is so good 21-03-2022 by Seun Verified Purchase 3 out of 5nice Yes the volume 18-03-2022 by rukevwe Verified Purchase 4 out of 5 Not bad at all What you see is what you get. ", "", "The sound isn't bad at all 17-03-2022 by Vivian Verified Purchase 4 out of 5 I like it Wow! , Is really nice, sounds so powerful 17-03-2022 by Evans Verified Purchase"], "22": [" 5 out of 5portable Its very portable, very good volume and bass. ", "It connects seamlessly with my Bluetooth devices then to my T V via aux  cord. Its simply amazing and very affordable. The only drawback is the remote. It does the work of a soundtrack seamlessly. 17-03-2022 by Akinnaso Verified Purchase 5 out of 5 Very decent It's good looking. Place the woofer in a corner, spread out the tweeters to get optimum result. ", "The sound is clean with enough bass. ", "It's actually a good buy. The sound can fill a room with enough loudness. 16-03-2022 by K U S I M O Verified Purchase 5 out of 5 Perfect Exactly what i ordered for 15-03-2022 by Jayden Ovat Verified Purchase 5 out of 5speaker Love the sound 15-03-2022 by Bolu Verified Purchase 5 out of 5 I love it It's cool for it's price 14-03-2022 by S U N D A Y Verified Purchase 5 out of 5 Good Better 14-03-2022 by O T A I B A Y O M I S O B O W A L E Verified Purchase 2 out of 5 I love it Very lovely product 12-03-2022 by Oluwafemi Verified Purchase 5 out of 5 Good product Very effective product 11-03-2022 by L E E Verified Purchase 5 out of 5 I love it I like the size nd d sound 09-03-2022 by Neo Verified Purchase 5 out of 5color Load and unique 07-03-2022 by Bode Verified Purchase"], "23": [" 5 out of 5 I really like it I like it 07-03-2022 by Adedeji Verified Purchase 5 out of 5love it Perfect quality sound production. 07-03-2022 by E M M A N U E L Verified Purchase 3 out of 5 Is very okay for cool Room But since I received it, still yet can't connect sound edifier with my Television 03-03-2022 by Y A K U B U Verified Purchase 4 out of 5 Good sound system Quality sound . It beats my expectations 03-03-2022 by Afeez Verified Purchase 5 out of 5awesome Recommended 02-03-2022 by adekunle Verified Purchase 4 out of 5 Not Bad The sound is ok, not much Bass 01-03-2022 by christian Verified Purchase 5 out of 5good Sounds good ? ? 28-02-2022 by oscar Verified Purchase 5 out of 5 Love it! The hype is real. . . 28-02-2022 by Bade Verified Purchase 5 out of 5 This is Totally crazy ? Can't believe how amazing this little sound system is, the bass is crazy, Bluetooth and everything is working perfectly. Guys I highly recommend this for anyone. 28-02-2022 by G O D W I N Verified Purchase 5 out of 5 I like it Love it, the only but is no radio 28-02-2022 by Ale Verified Purchase"], "24": [" 2 out of 5good You need to add radio F M to it 28-02-2022 by Olufeyimi Verified Purchase 4 out of 5 Nice It have good sound just that it doesn't come with remote 25-02-2022 by E Z E H Verified Purchase 5 out of 5 I love it The sounds is incredible, it's worth all the hype 22-02-2022 by Mustapha Verified Purchase 4 out of 5ok Fair enough for the price 22-02-2022 by U C H E Verified Purchase 4 out of 5to perfect the tlitem Include radio, remote, and battery to make it work without light. That will make it all. Thanks. 22-02-2022 by Akintunde Verified Purchase 3 out of 5 Small and might It's okay 21-02-2022 by S H I N A Verified Purchase 5 out of 5 Good product, great price Not bad at all 18-02-2022 by Isaiah Zehgi Verified Purchase 4 out of 5 Good Good product 17-02-2022 by olanrewaju taiwo Hassan Verified Purchase 4 out of 5 Good It's a nice product 15-02-2022 by Oladipo Verified Purchase 4 out of 5 I love it The sound is very ok for the price. Just sad, it doesnt have a remote. But it's cool! 14-02-2022 by Oni Verified Purchase"], "25": [" 5 out of 5 Super cool Portable cool 14-02-2022 by Jumoke Blessing Obatoyinbo Verified Purchase 5 out of 5 Nice The sound is good 14-02-2022 by gideon Verified Purchase 5 out of 5 I L O V E I T This speaker is something else. I don't know how to describe it, it's just too much. ", "", "Way above value for money 14-02-2022 by Esther Verified Purchase 4 out of 5 I like it It sound well 12-02-2022 by Asodun Verified Purchase 4 out of 5 I like it Very good and powerful product, but i would have rate it five stars, if only it comes with a remote. It has a very good sound 09-02-2022 by ogaranya Verified Purchase 5 out of 5 Awesome It's really a great product! I loved it! 09-02-2022 by Adedeji Verified Purchase 5 out of 5it's perfect I really like the sound it very loud 09-02-2022 by Mariam Verified Purchase 4 out of 5edifier It very O K 08-02-2022 by Oladele Verified Purchase 5 out of 5 Goodi like it. it fits in perfectly into my space 08-02-2022 by Ini Verified Purchase 4 out of 5it'sok It's ok for the price 07-02-2022 by Emeka Verified Purchase"], "26": [" 3 out of 5nishola Is good but it's should have been in a big form 07-02-2022 by ajbat Verified Purchase 5 out of 5perfect Serve good 02-02-2022 by ola Verified Purchase 5 out of 5 N I C E E E E! Omo, the product is a giveaway. Edifier is just being proud and deciding to do giveaway. It's way better than its price mehn! 01-02-2022 by Joshua Verified Purchase 5 out of 5 Nice Nice item 01-02-2022 by Jimmy Olu Verified Purchase 5 out of 5 It Tested Wow If You are reading this  review to get more  convinced as the other nice comments was enough for you, then I can help You! ! ", "Sit down and listen to me. ", "Look at the size of this Bluetooth speaker and imagine the best sound you are hoping to get from it and won't get disappointed, this E D I F I E R  plays better sounds  than what you imagined. . . ", "And imagine this hype I gave it is an 'underhype'. . ", "Yeah just ahead and click buy. . ", "But know this there are other sound box that could be better but none less than twice this price! . ", "", "", "", "Can I be your Hypeman? ", "Oh G E O R G E666@gmail. com 31-01-2022 by George Verified Purchase 5 out of 5 I like it Just a day after It was delivered, I am liking it. 31-01-2022 by Theenlightened Verified Purchase 3 out of 5 Amplified  sound The sound and volume is below average 31-01-2022 by Nasir Shehu Verified Purchase 5 out of 5wonderful The product works well 31-01-2022 by Mutiu Verified Purchase 4 out of 5good sound Good for the money", "But only one speaker works for auxiliary 28-01-2022 by Bukola Verified Purchase 4 out of 5it's cool But it never last long. . it couldn't O N again after a short while 25-01-2022 by Inah Verified Purchase"], "27": [" 5 out of 5 I love it Nice product 24-01-2022 by Stephen Verified Purchase 4 out of 5nice products Very good, I love it. But would have been better if it comes with a remote control 24-01-2022 by Emmanuel Verified Purchase 5 out of 5 I obsessed with it Until you buy it before you can feel because I obviously can't describe the joy I derive from it. 23-01-2022 by A D A M Verified Purchase 4 out of 5very hood and meet up to expectations. More speakers I guess. 21-01-2022 by Zobby Verified Purchase 5 out of 5the sound is superb What I ordered is what I get 21-01-2022 by Goodness Verified Purchase 5 out of 5i like it It's as it is 19-01-2022 by J E F F R E Y E L A I H O Verified Purchase 5 out of 5 Perfect if you know what you’re looking for Exactly what i was looking for 18-01-2022 by A Y O T U N D E O W O L A B I Verified Purchase 5 out of 5nice! Just ok for the price 17-01-2022 by J O H N Verified Purchase 5 out of 5nice! Just ok for the price 17-01-2022 by J O H N Verified Purchase 5 out of 5 Good buy The system is okay. Edifier products are good. The sound production is nice 17-01-2022 by Williams Verified Purchase"], "28": [" 5 out of 5good It's perfect for the price 17-01-2022 by H E N R Y Verified Purchase 5 out of 5 Great producty? ? great product 17-01-2022 by Eugene Verified Purchase 4 out of 5 Decent It’s a decent product for its price. 17-01-2022 by Li Verified Purchase 4 out of 5 I like it The sound is good for the price. 17-01-2022 by Ayodele Verified Purchase 4 out of 5 Lovely and portablesounds quite nice. . . esp d bass 17-01-2022 by Temi Verified Purchase 5 out of 5 Just as advertised! What I love most about this beautiful product is the output. It has a high and wondersound that meets my ears. Another thing is the, how do I put it? It does not require very high current to function: I love that, too. Other things are the multi media functions. Just beautifully wonderful. 14-01-2022 by Palngdirnen Dimka Verified Purchase 5 out of 5everything is perfect D sound legit 13-01-2022 by Queenzly Verified Purchase 4 out of 5i like itbut one speaker did not work and the bass is light and  not as i expected. 12-01-2022 by Daniel Verified Purchase 5 out of 5edifier m20 6 B T 68 watts multimedia speakers Is a good product", "Am enjoying it 11-01-2022 by Danmusa Verified Purchase 5 out of 5good Exactly as advertised 10-01-2022 by Jude Verified Purchase"], "29": [" 5 out of 5so nice Is the best 10-01-2022 by Olamide Verified Purchase 4 out of 5 I love it Product delivered as advertised, good sound quality 05-01-2022 by Olubode Verified Purchase 5 out of 5at 15k ill say its worth the price Perfect", "Bass is fantastic. 04-01-2022 by austin Verified Purchase 5 out of 5 I like how Loud is it and it Bass Make the speaker more Bigger and another output for external/addon speakers. . . 04-01-2022 by A M A K A N T H O N Y C H U K W U D I Verified Purchase 5 out of 5 Love it It gets the job done 31-12-2021 by Cyrus Verified Purchase 5 out of 5 The bass master Before I purchased this edifier I checked people's reviews and thought they were in serious or they were joking but I am glad to be a testifier this edifier is exactly what I expected", "The bus is amazing and it has a very good quality sound I really love it 31-12-2021 by Joseph Cj Verified Purchase 3 out of 5 Improve on the bass Increase the bass output and add F M radio 31-12-2021 by Seun A Verified Purchase 4 out of 5 Matching Description Very good portable sound system only that it has no remote 30-12-2021 by Praise Verified Purchase 5 out of 5mr I love everything about it, but not get remote 30-12-2021 by Shobur Verified Purchase 5 out of 5very nice productvery nice product 30-12-2021 by Bobby Verified Purchase"], "30": [" 5 out of 5perfect It's a good device, so loud and clear, it's perfect for low budget lover's of good and quality speaker. 30-12-2021 by Olapagbo Verified Purchase 5 out of 5perfect It's a good device, so loud and clear, it's perfect for low budget lover's of good and quality speaker. 30-12-2021 by Olapagbo Verified Purchase 3 out of 5 I like it I bought it based on the Testimony of others, the products was good, well sound but not up to the best of testifiers Exaggeration 30-12-2021 by D A N I E L A Y O K U N L E Verified Purchase 4 out of 5 Good for the price Considering the size, the sound is good and loud enough. ", "Bluetooth connects without noise and fast. ", "Long speaker cable. . . ", "Low power consumption. ", "The load is as light as charger when loaded with my solar system. . . Doesn't draw much current ", "", "In all, if you need a portable good speaker, this is best choice, but if you need a speaker with heartthrobbing bass, this isn't best pick for you 29-12-2021 by Mr Okafor Verified Purchase 4 out of 5 Anthony Very good for the price 29-12-2021 by Anthony Verified Purchase 4 out of 5 I like it Sounds nice for a small woofer. 29-12-2021 by Mohammed Alemiya Verified Purchase 4 out of 5 Efficient If you are obsessed about sound quality, you'll notice the sound separation is not at it's best. Every other thing is nice especially the build and design. It's built to last, classy, small and far better than anything I've seen at twice the price. 29-12-2021 by Itzebuka Verified Purchase 4 out of 5 Casual listening. It's loud and okay for casual listening. But look elsewhere if you're an audiophile or you care about sound separation. Mid frequencies are dull. 29-12-2021 by Uncle B Verified Purchase 4 out of 5 Ok for the price It’s ok but added remote, fm and speaker would make is so perfect 29-12-2021 by Adeniyi Adekunle Verified Purchase 5 out of 5 Good. Beautiful Very nice 29-12-2021 by Adams Verified Purchase"], "31": [" 5 out of 5 I like the bluetooth He sounds good 29-12-2021 by Oluwatosin Verified Purchase 5 out of 5 Excellent Great product, only challenge is that it has only one power source. . . no backup. Otherwise it's perfect 29-12-2021 by onyeka Verified Purchase 5 out of 5protable Small but mighty I love it 29-12-2021 by Isah Verified Purchase 5 out of 5 Nice Perfect 29-12-2021 by kel R K D Verified Purchase 5 out of 5booom Loud and nice,  its would have go well with remote control 29-12-2021 by olamide Verified Purchase 5 out of 5 I love it Dis sound system nah gbas gbos, small body big engine, d bass make sense for the size, it would be better if radio and remote is installed in it.  5 star plus 5 star? ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐ 29-12-2021 by nnamdi Verified Purchase 5 out of 5 Good Bass Works well and fine, but Bluetooth is not long range only indoors 29-12-2021 by Prospero Verified Purchase 5 out of 5good Good n sound well but remote is required 29-12-2021 by Abiodun Verified Purchase 5 out of 5 Highly Satisfactory It's been very impressive so far. . . 28-12-2021 by Adebayo Verified Purchase 4 out of 5very good. but. . No remote and I would have 4k with me if I had waited 2days before purchasing. ", "But it's good 24-12-2021 by oluwafemi Verified Purchase"], "32": [" 5 out of 5 Love it Looks just as in the picture. ", "Very loud, bass is great! ", "Wish it comes with a remote 24-12-2021 by G A B R I E L Verified Purchase 5 out of 5 Simply Awesome I hardly give reviews but I find this very product \"simply awesome\". It performs wonderfully. No unnecessary noise. Good bass control for optimum sound quality. It's just \"simply awesome\" as I've said. 24-12-2021 by C. A.Verified Purchase 4 out of 5 Yes Could have been better 23-12-2021 by Augustine Utsuekie Verified Purchase 5 out of 5 Perfect The sound is superb, but cannot work with decoder 23-12-2021 by O L U G B E N G A Verified Purchase 5 out of 5mr oluwafemi I like it at is small is good product 23-12-2021 by Oluwafemi Verified Purchase 5 out of 5 S H O R T E N G I N E If you are a lover of good sound and looking for a low budget powerful machine don't miss this magical sound system. I bought it for my leaving room and surprisingly this little machine with 60w capacity is making me to forget about the Sony 8900w in the sitting room. It worth more than the hype. My only regret is that I would have ordered for more unit before it went out of stock. 23-12-2021 by Dr P A U L Verified Purchase 5 out of 5 Amazing souds Compact sounds 22-12-2021 by S O L O M O N D I K E Verified Purchase 4 out of 5performance It's a good bt speaker just that it's not really loud on phone", "K 21-12-2021 by Jacob Verified Purchase 4 out of 5 Good bluetooth Player Great product 21-12-2021 by Dubem Verified Purchase 5 out of 5nice sound Sound is good n look portable but would've been more lovely if its with romote. . 21-12-2021 by Egbekunle Verified Purchase"], "33": [" 5 out of 5@gmail. com Nice sounds", "", "Nice sounds 20-12-2021 by A K I N D U N B I Verified Purchase 5 out of 5 Good Small but mighty 20-12-2021 by Olusegun Awolola Verified Purchase 2 out of 5 Edifier M206 B T Multimedia Speaker By adding radio to it and filtering the sound 17-12-2021 by Milala35 Verified Purchase 4 out of 5 I like it Working perfectly well. . . good bass effect. . . and very easy to use. ", "Wish it had a remote control though 17-12-2021 by Y E M I Verified Purchase 5 out of 5 Incredible sound It's perfect for a room, right amount of everything. 17-12-2021 by Elvis Akaehielam Verified Purchase 5 out of 5 Nice I love the product 17-12-2021 by bidemi Joseph Verified Purchase 5 out of 5 I like it Very good sound 17-12-2021 by Uzo Verified Purchase 5 out of 5val Nice sound ", "I will choose to call it small but mighty 16-12-2021 by somadina Verified Purchase 5 out of 5 Good sound Really worth it 16-12-2021 by Chisom Verified Purchase 5 out of 5 Awesome product Everything about this boom box is 5 star 16-12-2021 by D A V I D Verified Purchase"], "34": [" 5 out of 5niceworking pretty good 15-12-2021 by ola Verified Purchase 5 out of 5 Strong Bass Great Sound. 15-12-2021 by Dominic Savio Verified Purchase 5 out of 5careful how loud you play thocareful how loud you play 15-12-2021 by B A S H Verified Purchase 5 out of 5i really love it Sounds good 15-12-2021 by Richard Verified Purchase 5 out of 5 Super The bass is truly 68watts the sound is very good, but no remote control manual control but still dope I love it for real, I authorised anyone to buy it. 15-12-2021 by patrick Verified Purchase 4 out of 5 Good, but. . . . The speakers work fine but it would have been better if it has provision for memory card, remote control and F M radio 14-12-2021 by I S M A I L Verified Purchase 5 out of 5 Love it Small but mighty 14-12-2021 by Henry Verified Purchase 5 out of 5cool Nice bass 14-12-2021 by E B U N O L U W A Verified Purchase 5 out of 5 I love it Love it 14-12-2021 by Princewill Verified Purchase 5 out of 5 Perfect Loud, great sound, fantastic bass 14-12-2021 by N W O B O D O Verified Purchase"], "35": [" 5 out of 5 Far worth than the price. It's lovely. Only setback is that it doesn't have a remote control but aside that, its highly recommendable 14-12-2021 by Evidence Verified Purchase 5 out of 5 Amazing Sounds better than the size. It's the bomb. Bass is good, sound good. Not space filling. Good. 14-12-2021 by Slim Verified Purchase 5 out of 5 Awesome bass The bass was awesome, , , , Perfect definition of small but mighty 14-12-2021 by B O B S O N Verified Purchase 4 out of 5 It makes sense die This is one of the best speakers ive own ", "My neighbors are always complaining abt the loudness. . I love the quality of the wood very strong and durable with a sweet bass. Just buy and enjoy that all 13-12-2021 by Chinemerem Verified Purchase 4 out of 5 Bluetooth speaker It’s perfect for this size 13-12-2021 by azeez joseph Verified Purchase 5 out of 5 Good for the price Using while typing this message. Its cool and working great with my Smart T V, make the sweet mehn. The bass is a top notch ? ? 13-12-2021 by O T U N B A S H O F F Y Verified Purchase 5 out of 5portable Clear sound and bass. 13-12-2021 by Ebenezer Verified Purchase 5 out of 5 Speaker Sweet and make a lot of sense 13-12-2021 by Lincoln Adams Verified Purchase 4 out of 5 Good buy Not bad for its cost, enjoying it so far. . a remote would have been a killer but nevertheless it’s a good product 13-12-2021 by C H I B U Z O R B O S A H Verified Purchase 5 out of 5 I like it It's a great portable amplifier with great sounds that does not relate to its small size 13-12-2021 by Oluwaseun Verified Purchase"], "36": [" 4 out of 5 Great sound Loud sound 10-12-2021 by Temitope Bankole Verified Purchase 4 out of 5 Good product Good sound quality, I like it. 10-12-2021 by Ufuoma Verified Purchase 4 out of 5 Good product Good sound quality, I like it. 10-12-2021 by Ufuoma Verified Purchase 4 out of 5i like itnice product 10-12-2021 by Daniel Verified Purchase 4 out of 5 I like it Its good. . . 10-12-2021 by Ishaku Verified Purchase 5 out of 5 Edifier The sound is very Edible 10-12-2021 by A D E N E K A N Verified Purchase 5 out of 5lovely I love the speakers bass is very powerful and loud i love the design 10-12-2021 by D A V I D Verified Purchase 5 out of 5excellent Awesome! ! 10-12-2021 by Damilola Verified Purchase 5 out of 5love it The sound is dope. The watt is very ok for me. Good for inhouse use. Fancy look and durable item. 10-12-2021 by T H A N K G O D Verified Purchase 5 out of 5 Satisfactory It beats my expectations. Good job Edifier 10-12-2021 by Jostifyd Verified Purchase"], "37": [" 5 out of 5 I like it. Good value for price. Has a good sound effect especially when playing music from your phone. 09-12-2021 by Judith Verified Purchase 5 out of 5sound system review I have a problem with its paring but the sound is ok 08-12-2021 by V A L E N T I N E Verified Purchase 5 out of 5perfect small but mighthy Try to pull the house down", "Great bass 08-12-2021 by Anazor Verified Purchase 5 out of 5 Very good I like it 08-12-2021 by Ismail Verified Purchase 5 out of 5the sound is fine The base, but it will be better to add one more speaker 08-12-2021 by Osayamwen Verified Purchase 5 out of 5 More than what I saw online This is worth more than the money! 08-12-2021 by Akamo Verified Purchase 5 out of 5 Perfect for it's price The bass is solid, it's loud enough, cheap and portable. 08-12-2021 by Chukwunonso Verified Purchase 5 out of 5 A good buyprevious reviews on this product is top notch. product is exactly the way it is described in product description. Nice product, i love everything about the speaker; the sound, bass level. i will appreciate if there will be remote control for subsequent production of this product. 08-12-2021 by Taye James Verified Purchase 4 out of 5 I like the product It would have been nice if it has F M radio 07-12-2021 by S U N D A Y Verified Purchase 4 out of 5 I like it Really really good. Gould do with more speakers tho 07-12-2021 by Stephen Verified Purchase"], "38": [" 5 out of 5love it Great Sound 07-12-2021 by Abolarinwa Verified Purchase 5 out of 5performance The Bass is lit 07-12-2021 by Adawuofor Verified Purchase 5 out of 5good Sounds great 07-12-2021 by Precious Verified Purchase 5 out of 5 Excellent The sound is outstanding, very excellent buy 07-12-2021 by Abbas Verified Purchase 5 out of 5very good It's a good product for it's price 07-12-2021 by O Y E W O L E Verified Purchase 3 out of 5 Mid range It’s okay if you’re not looking for party level volumes. No remote control tho 07-12-2021 by Obinna Verified Purchase 4 out of 5 I like Good sound output. 07-12-2021 by Nkemakolam Verified Purchase 4 out of 5this is the best i love it To be able to connect to tv nd more speakers 07-12-2021 by Ehis Verified Purchase 5 out of 5 I’m definitely going to repurchase Here this product is d best ever I ordered on this app. . The packaging, the design, the sound, it’s lovely. . ? . I’d recommend anyone to buy. Value for ur money 07-12-2021 by Timmy Dennyd Verified Purchase 5 out of 5 So lovely I love it , 07-12-2021 by Atoki Mayowa Verified Purchase"], "39": [" 5 out of 5 Nice product Portable and sound quality 07-12-2021 by N O B L E E.Y N W I A N A H Verified Purchase 5 out of 5good sound Sound is perfect 07-12-2021 by Blessing Verified Purchase 5 out of 5good sound Sound is perfect 07-12-2021 by Blessing Verified Purchase 5 out of 5 I sincerely love this product I wish there was an extra star to add to the rating of this \"Small body, big engine\" product. . . That would have being my option because this product is amazing, it's simply the best in it's class. I have no doubt whatsoever to recommend it for anyone in need of a perfect portable sound system for your listening pleasure. Go for it, it's Value for Money. Thanks to Edifier, thanks to Jumia, Delivery was absolutely O K. Kudos for a perfect job well done. 07-12-2021 by Muebari Verified Purchase 5 out of 5 Pepper ? ? them Small but mighty ? ? 07-12-2021 by Abdul Raheem Verified Purchase 5 out of 5 I L O V E I T W O W I G O T T H E M O S T S P E A K E R S I N T H E W O R L D O N J U M I A 06-12-2021 by Akinwumi Verified Purchase 5 out of 5 Worth it It's really worth the price 06-12-2021 by Eric Verified Purchase 5 out of 5very very good The sound is so good. 06-12-2021 by Ajanihu Verified Purchase 5 out of 5 I love it It works perfectly and the sound and bass are top notch ❤️ 06-12-2021 by Oluwabukola Verified Purchase 5 out of 5 I like it Well sounded and portable 06-12-2021 by Kazeem Verified Purchase"], "40": [" 4 out of 5 It's okay The product is okay 06-12-2021 by Saheed Verified Purchase 4 out of 5 Nice It’s cool 06-12-2021 by Abimbola Ola Jegede Verified Purchase 5 out of 5 Great product Sounds goods. ", " Good deal. 06-12-2021 by Augustine Verified Purchase 5 out of 5 Very Nice Device The sound system is really nice with a very good output. 06-12-2021 by Onakoya Verified Purchase 5 out of 5 Nice Product This is a nice product. Bass is quality enough. 06-12-2021 by Michael Verified Purchase 5 out of 5 Michael@2 3 The sound 06-12-2021 by Babatunde Verified Purchase 5 out of 5 Exceptional product Jumia always surprises me with their 4 days delivery time. The product is superb. 06-12-2021 by Patrick Verified Purchase 5 out of 5great sound Portable and sounds well 06-12-2021 by Richmond Verified Purchase 5 out of 5 Great Sound The Sound is Great, Wish it had a Remote Control 06-12-2021 by blessing thompson Verified Purchase 5 out of 5 Good product for the price It's okay for the price. A good product. Edifier is a great company. The sound production is fine. For a sound system at that price its a good buy 06-12-2021 by Chibuzo Verified Purchase"], "41": [" 5 out of 5 I like it Good sound well 03-12-2021 by Lovelyn Verified Purchase 5 out of 5 A1 Great ? ? cool sound 03-12-2021 by Spechy Moses Verified Purchase 5 out of 5very good Good bass 03-12-2021 by Azeez Verified Purchase 5 out of 5 Great product I'm a very careful buyer, so I had to check a lot of reviews before buying this product. I bought it because many said good things about and guess what? ? It blew my mind when I bought it as well. Portable, decent, clear sound production and everything you can demand from such a product. ", "", "It's affordable and wonderful. I definitely recommend it to anyone. ", "", "What can be improved? Remote and F M could be added. If possible, make the pair of speakers a bit bigger. 03-12-2021 by Jidonu Verified Purchase 3 out of 5not so. bad. for its price Should have a remote 03-12-2021 by Precious Verified Purchase 4 out of 5 Nice Product Nice product. . . the sound is super cool based on it capacity. . . 03-12-2021 by Godwin Verified Purchase 4 out of 5 I like it But it don't have F M radio 03-12-2021 by Oyebulejo Verified Purchase 5 out of 5 Great bass Sounds well 03-12-2021 by Alao Marvellous Verified Purchase 5 out of 5 Perfect Fabulous design and Great sound quality. 03-12-2021 by Samuel Verified Purchase 5 out of 5 Efficiency of the sound Well worth the black Friday price 03-12-2021 by Samuel Verified Purchase"], "42": [" 5 out of 5 It’s perfect It’s exactly as expected. 03-12-2021 by Radiant Tom Verified Purchase 5 out of 5 Awesom Sounds quality perfect", "I love everything about it 03-12-2021 by J O H N Verified Purchase 5 out of 5 N I C E S T U F F Brilliant sound quality. Exactly as advertised. 03-12-2021 by O J E E K A Verified Purchase 2 out of 5 The bluetooth is not working Bluetooth is not functioning I don’t know what to do about it 03-12-2021 by Davidmark Johnpaul Verified Purchase 4 out of 5awsum I like 03-12-2021 by Joshua Verified Purchase 4 out of 5 I like it Good sound, portable and sleek. The manufacturer should think of adding remote control 03-12-2021 by Clems Verified Purchase 4 out of 5edifier So far so good. It's working very well 03-12-2021 by Lanre Verified Purchase 4 out of 5 Good product Its nyc 03-12-2021 by Abubakar Saidu Verified Purchase 5 out of 5impressive Excellent sound 03-12-2021 by Durden Verified Purchase 5 out of 5 Perfect Having fun with it. ", "Will totally recommend. 03-12-2021 by Raymond Verified Purchase"], "43": [" 5 out of 5 I like it Love the sound 03-12-2021 by O K E K E Verified Purchase 5 out of 5love it One of the best 03-12-2021 by Adeyinka Verified Purchase 5 out of 5 It's perfect Good design, Its loud and the bass is great for its size, it even has a control to increase or reduce the amount of bass. The speaker size is also what I expected not home theater big but not small either. It also connects easily via bluetooth and aux. This was a good buy. 03-12-2021 by Anthony Verified Purchase 5 out of 5soo unique Nothing but absolutely perfect I love it 03-12-2021 by Gabriel Verified Purchase 5 out of 5 Good It is very O K 01-12-2021 by Simon Verified Purchase 5 out of 5potability. Ability to connect with any electronic devices 01-12-2021 by moses Verified Purchase 5 out of 5awesome product Worth the price 01-12-2021 by Obeya Verified Purchase 5 out of 5 Lovely I love it so much, thank you jumia surely ordering for more as Xmas present for my loved ones ? ? 01-12-2021 by Rosemary Biose Verified Purchase 5 out of 5solidit is worth the hype. sound system is solid for the price. 01-12-2021 by Tennyson Verified Purchase 5 out of 5 Good product Nice goods 01-12-2021 by Adekunle Basit Verified Purchase"], "44": [" 5 out of 5the sound It sound very well 01-12-2021 by Patrick Verified Purchase 5 out of 5 Its superb. Beats my imagination. Its just as the info. Its serves even more than the price. ", "Must include remote control. 01-12-2021 by Shola Verified Purchase 4 out of 5 I like it Could have come with a remote tho' nothing spoil we move 01-12-2021 by Fakorede Verified Purchase 5 out of 5 Works Very Well Works very well and the brass is great. I love it. Great Product! Really 01-12-2021 by Chukwuemeka Verified Purchase 5 out of 5lts perfect. I love the emission of the sound. Very harmonic. 01-12-2021 by Chukwubunna Verified Purchase 5 out of 5qood qualityit worth than it's money 01-12-2021 by Ajayi olamilekan Verified Purchase 5 out of 5 It's nice, easy to operate, very loud Good product, I can recommend it any day, any time. 01-12-2021 by odunaike Verified Purchase 5 out of 5 I love it It's a very good product 01-12-2021 by Azeez Verified Purchase 5 out of 5 Great product Excellent product, sweet sound, deep bass 30-11-2021 by Samuel Verified Purchase 4 out of 5 It’s cool Product is very okay, I’m enjoying it. I advise they should do another model that will include a radio and a remote. 30-11-2021 by Olawale Verified Purchase"], "45": [" 5 out of 5 I like it It's actually so good 30-11-2021 by Jane Verified Purchase 5 out of 5 I love it A quality product with good sound ? ? output. 30-11-2021 by Peter Verified Purchase 5 out of 5 It's Perfect Perfect for the price n beyond. Sound, bass n everything is top ? ? 30-11-2021 by Joyce Verified Purchase 5 out of 5 Love it As expected nice sound output 30-11-2021 by A D E B A Y O Verified Purchase 4 out of 5 I like it It's okay but no remote 30-11-2021 by Olowolafe Verified Purchase 4 out of 5 I like it The product is really good, I love the sound. It’s worth the money 30-11-2021 by Ayomide Verified Purchase 5 out of 5the sound is perfect Portability 30-11-2021 by Ibe Verified Purchase 4 out of 5recomendation In fact it's beyond my expectations 30-11-2021 by Adepride Verified Purchase 4 out of 5 Nice product Sounds nice but the bass can be better, overall its very good for the price 30-11-2021 by Solomon Verified Purchase 5 out of 5bass. wes. wow So lovely and handy also decorated for hanging too 30-11-2021 by Taiwo Verified Purchase"], "46": [" 5 out of 5bass. wes. wow So lovely and handy also decorated for hanging too 30-11-2021 by Taiwo Verified Purchase 5 out of 5 I love it I love it 26-11-2021 by Kola Verified Purchase 5 out of 5 Happy Great product 26-11-2021 by Ajay Amobi Verified Purchase 4 out of 5was okay Was what I ordered for 26-11-2021 by Jeffrey Verified Purchase 4 out of 5 Good stuff Its value for money, The lower frequency ranges (bass) slightly distort and arent as clean, but other if you aren't using it in a production context I have no complaints 26-11-2021 by A K I N M A Y O W A Verified Purchase 5 out of 5wonderful sound system Bass from the subwoofer is amazing. I like the split of the right and left sound from the speakers. And when cranked up, really shakes a room. 26-11-2021 by F I D E L I S Verified Purchase 5 out of 5 It nice It cool I love it 26-11-2021 by Kenaz Nwakamma Verified Purchase 5 out of 5 Perfect D Sound Was Amazingly Nice 26-11-2021 by Olamzkid Next Grammy Winner ? Verified Purchase 5 out of 5 Awesome The size and the bass ? ? it produced and the small speakers are awesome ? ? ? ? 26-11-2021 by Adam Verified Purchase 5 out of 5absolutely great To be honest you won't regret buying it ", "The sound is nice and the bass is great for the amount 26-11-2021 by David Verified Purchase"], "47": [" 5 out of 5 Edifier M206 B T Awesome sound production. I will buy it over and over again. We got three of it in my household already. 26-11-2021 by P E T E R Verified Purchase 5 out of 5 I like it The product is a cool and good sound system. . this is what we call. . . Small body big engine. . . 25-11-2021 by Sanni Verified Purchase 5 out of 5mr Thanks for letting me know about the best way forward. Perfectly fine Soundsystem 25-11-2021 by Emmanuel Onyikemeka Verified Purchase 5 out of 5 It’s perfect already Very good 25-11-2021 by Ahmad Hassan Verified Purchase 5 out of 5 Perfect The bass is out of this world. Portable, Classy and top notch delivery. 25-11-2021 by Eni Verified Purchase 5 out of 5cool production Small but okay sound 25-11-2021 by Joel Verified Purchase 5 out of 5good sound bass Good product 25-11-2021 by Sani Verified Purchase 5 out of 5 Good Am enjoying my Edifier m206 Bt 68watts channel 25-11-2021 by Awoleye Verified Purchase 5 out of 5good producttoo good, i like it 25-11-2021 by nwankwo Verified Purchase 5 out of 5love it The sound on this thing crazy. Really good purchase for me 25-11-2021 by Kelvin Verified Purchase"], "48": [" 4 out of 5 It’s a great buy It’s perfect 23-11-2021 by Korede Isaac Verified Purchase 5 out of 5 The sound is something else, small but mighty! The sound 23-11-2021 by Aigbokhaevho Verified Purchase 5 out of 5 I love it The sound production is awesome 23-11-2021 by C H I D I E B E R E Verified Purchase 4 out of 5great device Good love it, they should include a remote 23-11-2021 by Pstr Joseph Verified Purchase 5 out of 5its cool Its Cool and ready hit the rock 23-11-2021 by Emmanuel Verified Purchase 5 out of 5 I like it Efficient 23-11-2021 by O L A M I D E Verified Purchase 5 out of 5 S M A L L B U T M I G H T Y I S V E R Y E F F E C T I V E.. . . G O O D V A L U E F O R T H E M O N E Y.. . . I L I K E I T.. . . . M A Y B E I F R E M O T E A N D R A D I O C A N B E A D D E D . . . . T H E N I T W I L L B E M O R E F A N T A S T I C.", "T H E S O U N D I S F I N E, C O O L A N D L O U D E N O U G H. 23-11-2021 by C O M R A D E A B D U L G A N N I Y O G U N D E L E Verified Purchase 5 out of 5 Best Buy I had my doubts initially, as I’m used to the premium products (you know them already). But this product gave me another perception to life, which is “it doesn’t have to be expensive to be good”…. A word is enough for the wise. 23-11-2021 by O L A I T A N D I P O Verified Purchase 5 out of 5bass The bass and the sound 23-11-2021 by Innocent Verified Purchase 5 out of 5good It sound good 23-11-2021 by Vincent Verified Purchase"], "49": [" 5 out of 5 Awesome It's perfect. Great sounds 23-11-2021 by A A R O N Verified Purchase 5 out of 5 Good sound It's portability 23-11-2021 by Chimezie Verified Purchase 5 out of 5 Powerful The product has a good output and design. 23-11-2021 by S I M O N Verified Purchase 5 out of 5 Lovely, I love it Good for the money! 22-11-2021 by O L A L E K A N Verified Purchase 4 out of 5 I like It's a fair bargain for the price 22-11-2021 by Joseph Verified Purchase 5 out of 5 Cool. Very coolso \"D O P E\" guys! ! 22-11-2021 by Alfred Verified Purchase 5 out of 5ok Ok for the price 22-11-2021 by Nero Verified Purchase 5 out of 5satisfied Is so worth the value, , So far I'm enjoying mine? ❤️ 22-11-2021 by Nancy Verified Purchase 5 out of 5 It's nice Good audio quality production. The Bass is super good 22-11-2021 by Lawrence Verified Purchase 5 out of 5the sound na diehave you hear of the saying small but mighty ? this the true definition 22-11-2021 by S E G U N Verified Purchase"], "50": [" 5 out of 5 I love it I was amazed seeing it when I received it ", "It’s even beyond my expectations 22-11-2021 by Azeez Verified Purchase 5 out of 5i love it very audible Very Audible and sounds great extremely silent when inactivity too, Didn't regret my purchase 22-11-2021 by Aanuoluwapo Verified Purchase 5 out of 5i like itis working perfectly and the sound is clear 22-11-2021 by olajide Verified Purchase 5 out of 5 Edifier Sounds great 19-11-2021 by Uchechukwu Verified Purchase 5 out of 5 I love this It has a good bass, portable and comfortable. 19-11-2021 by olabisi Verified Purchase 5 out of 5 I L I K E I T I T'S G R E A T 19-11-2021 by Oswin Verified Purchase 5 out of 5 I love it! It’s a good buy for its budget. The sound is so clear, the adjustable bass is complementary. The design is minimalist. ", "I’d recommend it if you have a low budget. 19-11-2021 by O L A N R E W A J U Verified Purchase 4 out of 5 I got exactly what i ordered for keep it up It is ok l love the sound the woofer is small anyway but it is good for the price 18-11-2021 by Peter Verified Purchase 4 out of 5 Good Product Good product. Works well. Bass is top notch and for the fact you can regulate the bass is dope and yes, no remote but you can do that with the device you’re using to set a specific volume. Great stuff though. 18-11-2021 by Samuel Sonowo Verified Purchase 4 out of 5best Greatest purchase 18-11-2021 by Newton Verified Purchase"], "51": [" 4 out of 5 Nice product It's very okay for the price. Nice 18-11-2021 by A Z E E Z Verified Purchase 4 out of 5 I Like It It's so cool. 18-11-2021 by Chinedu Verified Purchase 4 out of 5 Remote Control Add Remote Control feature 18-11-2021 by V I C T O R Verified Purchase 4 out of 5bluetooth specakers It was so ", "Nice 18-11-2021 by O M O T U N D E Verified Purchase 5 out of 5perfect Working great . . . . nice for it's price 18-11-2021 by Oluwatuyi Verified Purchase 5 out of 5 I love it It's worth every penny 18-11-2021 by Kayode Verified Purchase 5 out of 5awesome speakers They sound great and very compact. Love it 18-11-2021 by E R O N S S Verified Purchase 5 out of 5good A good quality 18-11-2021 by S I D E E Q Verified Purchase 5 out of 5 Very good product Sound is great and easy to operate. nice one 18-11-2021 by Agbeja Verified Purchase 5 out of 5jumia Perfectly O K . . . . but the delivery was too poor 18-11-2021 by Gabriel Verified Purchase"], "52": [" 1 out of 5 Can't connect it to D S T V The input port is not compatible with D S T V own 18-11-2021 by O L U W A S A N M I Verified Purchase 4 out of 5 Lovely Nice sound output. . . Loving it 17-11-2021 by Michael Verified Purchase 4 out of 5 M R Amazing 17-11-2021 by Emmanuel Verified Purchase 5 out of 5abubakar gimba I love it 17-11-2021 by gimba Verified Purchase 5 out of 5edifier M206 B T It's perfect 17-11-2021 by Omoniyi Verified Purchase 5 out of 5 Lovely! Good sound system. 17-11-2021 by Moses Verified Purchase 5 out of 5 Good product I love the sound and the bass that produce. . . 17-11-2021 by Abdulganiu Verified Purchase 5 out of 5 Awesome bass, clear sound It has this very clear sound. . . yet to test it with my T V but so far it's been a great experience using it 17-11-2021 by Osayuki Raymond Verified Purchase 5 out of 5 I like it Portable with good sound 17-11-2021 by Enoch Verified Purchase 5 out of 5i love it The second the flexibilities 17-11-2021 by Okafor Verified Purchase"], "53": [" 5 out of 5so sound I love it 17-11-2021 by Taiwo Verified Purchase 5 out of 5 I love it. The sound and bass are awesome. It's best for a small room or studio. The tweeters are incredibly awesome. No dragged bass even at a high level. 17-11-2021 by A D E D A Y O Verified Purchase 4 out of 5perfect Perfect 16-11-2021 by Gideon Verified Purchase 4 out of 5edifier speaker Nice one 16-11-2021 by Haney Verified Purchase 4 out of 5i like it If it can probably have a remote control, i think it would be better 16-11-2021 by Bankole Verified Purchase 4 out of 5 Good Nice but size is very small 16-11-2021 by Egbadon Verified Purchase 4 out of 5i like it I like the speaker, the sound is ok but It can't connect to my laptop vis Bluetooth 16-11-2021 by Onyinye Verified Purchase 4 out of 5very Goodi liked it. . . its very good for its price and very easy to operate. . . it will be nice if the manufacturer can add a remote and Radio to it. . . 16-11-2021 by dayo Verified Purchase 4 out of 5 I like it The item is good and has a quality sounds 16-11-2021 by Afeez Verified Purchase 5 out of 5 Great Sound Sounds great 16-11-2021 by N A T H A N A E L Verified Purchase"], "54": [" 5 out of 5it very Okay It worth the amount 16-11-2021 by omiyale paul Verified Purchase 5 out of 5nice It is so loud and full of bass 16-11-2021 by Onyinye Verified Purchase 5 out of 5i like itdefinitely worth the money, only sad that it doesnt have remote 16-11-2021 by A D E W A L E Verified Purchase 5 out of 5 I Love it Perfect sound, Loud and Portable 16-11-2021 by Blessing Verified Purchase 5 out of 5it cool The sound and the designs 16-11-2021 by A F E E Z Verified Purchase 5 out of 5portable Portable and loud 16-11-2021 by Seun Verified Purchase 5 out of 5it's ok I'm having a problem with one of the speaker. But overall it's a good product 16-11-2021 by taiwo Verified Purchase 5 out of 5 Great sound Preferably for indoor use. 16-11-2021 by Emmanuel Verified Purchase 5 out of 5 I love it It's worth it, clear sound system 16-11-2021 by Victor Verified Purchase 5 out of 5portable Have bought lyk 4 now, very portable for small room 16-11-2021 by Akporede Verified Purchase"], "55": [" 4 out of 5 Working good The sound is nice. Expected more from the woofer but it's okay. Perfect for single room, small place. 15-11-2021 by Olatunde Verified Purchase 4 out of 5good Very nice 15-11-2021 by B U K O L A Verified Purchase 4 out of 5good Not much work there just the bacs 15-11-2021 by Umukoyibo Verified Purchase 4 out of 5 I like it Small but mighty 15-11-2021 by Adesola Verified Purchase 4 out of 5remote control Very portable", "Easy to operate", "And audible enough", "But not too good with out a remote. adding a remote control to the machine would make it more perfect 15-11-2021 by Oluwasegun Verified Purchase 5 out of 5 Excellent product from Edifier. It's a bomb, I love it's compact size. Deep bass, clear sound. Best multimedia speaker at such a price. ", "I loved shopping. . . ! 15-11-2021 by G O O D L U C K Verified Purchase 5 out of 5 Excellent Value for money. . . Love it. Bass is okay 15-11-2021 by C H U K W U D I Verified Purchase 5 out of 5 I love it Perfect 15-11-2021 by Peredi Verified Purchase 5 out of 5 Omo goes well o Bass is lit lit lit 15-11-2021 by B E N S O N M I C H A E L Verified Purchase 3 out of 5 I like it Is okay 13-11-2021 by Walther Verified Purchase"], "56": [" 5 out of 5 I like it Very portable and worth the money 12-11-2021 by Adegun Verified Purchase 4 out of 5 I love it I love it but one of the speaker out put is not working 11-11-2021 by Eduviere Verified Purchase 5 out of 5 The real deal I can only wonder what else someone that criticizes this product could be looking for except that it doesn't come with a remote controller, it's just perfect, the base is impressive. 11-11-2021 by Olatunbosun Verified Purchase 5 out of 5mr Delivery and the sound 11-11-2021 by Raphael Verified Purchase 5 out of 5 I like it It meet my expectations and I love it. 09-11-202 1 by Olatunji 72 Verified Purchase 3 out of 5 Good It worth the price 08-11-2021 by Joshua Verified Purchase 4 out of 5 Nice Not bad 08-11-2021 by Ayo Verified Purchase 5 out of 5 Very enjoyable I’m totally loving it. . . . 08-11-2021 by Zeno King Verified Purchase 5 out of 5super product No regret 08-11-2021 by O L U W A G B E N G A Verified Purchase 5 out of 5i like itits nice 08-11-2021 by Michael Verified Purchase"], "57": [" 5 out of 5imoh Ok and portable 08-11-2021 by imoh Verified Purchase 5 out of 5 Edifier M206 B T Love the product 08-11-2021 by Joshua Verified Purchase 5 out of 5perfectly working Just as I order it 08-11-2021 by Samuel Verified Purchase 5 out of 5 I like it Beautiful device. Love the way it sound. As shown in the description, so it is in reality. Thumbs up. 06-11-2021 by Emmanuel O Verified Purchase 5 out of 5good Good, it's very loud 05-11-2021 by Nonye Verified Purchase 5 out of 5 I love it! Top notch 04-11-2021 by Sunday Verified Purchase 5 out of 5i love it Production 04-11-2021 by Ibezim Verified Purchase 1 out of 5edifer m206bt Am enjoying it , it was in good condition 03-11-2021 by Donatus Verified Purchase 3 out of 5 Good Manageable 03-11-2021 by S A M U E L Verified Purchase 4 out of 5 I like it It has a good sound quality and a good budget sound system 03-11-2021 by M U H A M M A D Verified Purchase"], "58": [" 4 out of 5 Good Okay for the price 03-11-2021 by Chinedu Verified Purchase 5 out of 5great Great sounds. 03-11-2021 by T O H E E B Verified Purchase 5 out of 5 E D I F I E R M206 B T I like the bass, very nice 03-11-2021 by Melvin Verified Purchase 5 out of 5 I love this System It's so lovely, I tried it out on a low power current and it worked just fine. 03-11-2021 by Kingsamuel C. Nwachukwu Verified Purchase 4 out of 5i like it I like the Bluetooth but the Bluetooth no get Fm radio which is not good 21-10-2021 by Ebenezer Verified Purchase 1 out of 5i dont like it No remote control device, very obsolete", "", "No remote control, very obsolete. 21-10-2021 by O L U G B E N G A Verified Purchase 4 out of 5okaysmall than it seems on the picture. but cool (wish there was a remote) 18-10-2021 by Ebenezer Verified Purchase 5 out of 5 Perfect Should have been a bit bigger but that didn't limit its qualities. Bass is out of this world 15-10-2021 by Vitalis Verified Purchase 5 out of 5 I like it. Awesome 15-10-2021 by Adeoye Verified Purchase 3 out of 5it could It's could be better with a radio in it 14-10-2021 by john Verified Purchase"], "59": [" 4 out of 5small but mightyfirst of, i like the build of the whole thing, very compact. ", "Both side speakers sound well and the subwoofer is trying it's best (i don't like loud music, so  it's fine for me. ", "Like every other review has stated, it needed to have a remote. If ii notice any other thing, i'll come back to this review. 13-10-2021 by Abyhonour Verified Purchase 5 out of 5 I like it Dope as expected ? ? 12-10-2021 by Fada Murph Verified Purchase 5 out of 5i love it Its has good sound and bass 11-10-2021 by S M A R T Verified Purchase 5 out of 5 Good product Works well even on low current 11-10-2021 by Peter Okereke Verified Purchase 5 out of 5 Edifier M206 B T It is really good and up to expectations. 11-10-2021 by Matilda Verified Purchase 5 out of 5perfect So nice 10-10-2021 by Oluwasegun Verified Purchase 5 out of 5 Booming banging sound ✔Distinct sound quality gets best depending on the device you connect to it. Time to do away with my soundbar. It's worth buying, the perfect plus to your shelf. 07-10-2021 by Oluwaseyi Verified Purchase 5 out of 5the bass is ok It can carry low courant 07-10-2021 by Udeme Verified Purchase 5 out of 5 It met my expectation I thought It would be like what I bought vs what I got scenario, but it was what I expected I got. Same product with what I saw on You Tube reviews. 07-10-2021 by Onos Verified Purchase 5 out of 5 I love it It's nise and portable 07-10-2021 by Samuel Verified Purchase"], "60": [" 5 out of 5 It's perfect. It's perfect as advertised. 07-10-2021 by M I C H A E L Verified Purchase 5 out of 5 Master It's edifying sound is just so perfect 06-10-2021 by solomon Verified Purchase 5 out of 5 Nice Very good sound 06-10-2021 by Daniel Udofia Verified Purchase 5 out of 5 Love it Perfect 05-10-2021 by Emmanuel Verified Purchase 3 out of 5 It doesn’t have Bluetooth You should give all the reviews about it well. 04-10-2021 by U C H E C H U K W U S U C C E S S Verified Purchase 4 out of 5i like itvery nice 04-10-2021 by B A D A Verified Purchase 5 out of 5 Too much B A S S Really, I took my time to read others review and I am so stunned by its performance. . . The system is a top notch and good bargain for the money. . . If you are looking for a \"small but mighty\" banger, go for it. Yes, no remote but connected device will do that. 04-10-2021 by Adetayo Verified Purchase 5 out of 5 Best is an Understatement This sound system is the best. . . . No be size be sound na quality of weytin dey inside that small body ! ! 03-10-2021 by Folarin kehinde Verified Purchase 5 out of 5 Very Good Sound Quality You can never go wrong with this product if sound quality is what you are looking for. Its not the loudest subwoofer but it is great for its price. Best value for money 02-10-2021 by A S U Z U Verified Purchase 4 out of 5 I like it It is working just fine 02-10-2021 by H A S S A N Verified Purchase"], "61": [" 4 out of 5perfect sound One of the best sounding sound systems for that price 01-10-2021 by V I C T O R Verified Purchase 5 out of 5 I like it Works well for a small space 30-09-2021 by Temitayo Verified Purchase 5 out of 5 I like it Very very lovely 30-09-2021 by King Verified Purchase 5 out of 5 Great Love it 28-09-2021 by David Verified Purchase 5 out of 5 Lovely Its a low budget speaker it worth the price. Banger Everyday 26-09-2021 by Naga Verified Purchase 5 out of 5love It Better Than I expected. . . . . . . . Good product  and highly recommended 26-09-2021 by C O L L I N Verified Purchase 5 out of 5amazing user friendly bluetooth speaker Ease of use. . . 24-09-2021 by Foye Verified Purchase 5 out of 5nice Nice quality 23-09-2021 by U W O M A N O O F E J I R O Verified Purchase 3 out of 5 Good but Sounds is good but no radio no remote 23-09-2021 by samuel Verified Purchase 5 out of 5 Giod Its the best for the price, it worth it. 23-09-2021 by Ayobami Verified Purchase"], "62": [" 5 out of 5 I like it I love it . Great  purchase! ! I'm enjoying it. 21-09-2021 by Felix Verified Purchase 5 out of 5its goood It's sound well 21-09-2021 by Olumide Verified Purchase 5 out of 5one of a kind I love it. . . Very audible 21-09-2021 by Yemi Verified Purchase 5 out of 5 Perfect I was impressed with the speakers I got, I’m actually playing some music with the speakers and I must say the quality is top notch I would totally recommend this to anyone who wants to get an average Bluetooth speaker with good quality for a decent price also the delivery was really fast that’s something to get a 5 star for and you got it. 20-09-2021 by Eric Pegasus Verified Purchase 5 out of 5 I like it Good sound. Wish it had a rechargeable battery attached 19-09-2021 by Chukudi Verified Purchase 4 out of 5 It’s nice Okay for the price", "I won’t regret buying it 18-09-2021 by Anthony Verified Purchase 3 out of 5 Good Product I love it, simple body. Magical sound 18-09-2021 by greatness Verified Purchase 3 out of 5 Good for a Bachelor A remote will do pretty just fine. Sound is good and for its price it's fair 16-09-2021 by Thomas Verified Purchase 4 out of 5 L I K E I T I T meets the immediate needs 16-09-2021 by Olasumbo Verified Purchase 4 out of 5 It more better! It very very portable. . 16-09-2021 by Temitope Olamide Verified Purchase"], "63": [" 4 out of 5very cool I wish it came with a remote 15-09-2021 by Ogunberu Verified Purchase 5 out of 5 I like it The product is ok 14-09-2021 by yinka Verified Purchase 4 out of 5 I like it It's nice just wish it had a remote 14-09-2021 by Forrest Verified Purchase 5 out of 5 Love it Good  tanks 13-09-2021 by Inioluwa Verified Purchase 5 out of 5 Nice Its cool enough 13-09-2021 by Bonnie Verified Purchase 5 out of 5 Edifer It’s nice but too small in physics 12-09-2021 by Bamidele Tosin Verified Purchase 4 out of 5the control remote was not available It doesn't have a  control remote 12-09-2021 by Reeeyamah Verified Purchase 4 out of 5 I like it It's good 11-09-2021 by Nwachukwu Verified Purchase 5 out of 5 Good sound So sound, small but mighty 11-09-2021 by Iwuchukwu Verified Purchase 5 out of 5 Good buy Thanks guys best product 11-09-2021 by A N I Z Z Y Verified Purchase"], "64": [" 5 out of 5 I like it Excellent 11-09-2021 by Taiwo Verified Purchase 5 out of 5 I love it The sound is awesome. But please add remote control for easier access. 09-09-2021 by Okorie Verified Purchase 3 out of 5woofer issue The woofer didn't sound the way I like 09-09-2021 by A D E S O L A Verified Purchase 5 out of 5assessment It's portability 09-09-2021 by Adelakun Verified Purchase 5 out of 5 So cool Whatever was said in the description is nothing but the truth! ! 08-09-2021 by Precious Verified Purchase 5 out of 5 I like it I like it 07-09-2021 by Akeem Verified Purchase 5 out of 5multimedia speaker Very portable and good sound, but the problems is the remote that it does not have. 07-09-2021 by okumakuma Verified Purchase 4 out of 5see below By ensuring it has micro disc /Sim slot 06-09-2021 by A B I O D U N Verified Purchase 5 out of 5 It's Fantastic Great sound, works well, decent price. 06-09-2021 by P R E C I O U S Verified Purchase 4 out of 5 Ok for a small room Remote would be great 06-09-2021 by P M Verified Purchase"], "65": [" 5 out of 5 I like it It's original and the sound quality is great. 03-09-2021 by Idorenyin Verified Purchase 5 out of 5very nice The sound quality 03-09-2021 by Mukthar Verified Purchase 4 out of 5 Good Sound quality, I like it. I like how simple and portable the Bluetooth Multimedia Speakers looks. 31-08-2021 by Betsuaye Verified Purchase 5 out of 5 Great stuff Edifier products are about my favorite sound systems and this didn't disappoint. 31-08-2021 by Barnabas Verified Purchase 4 out of 5 I like it Lovely n portable, just as I like it 31-08-2021 by Olasunkanmi Verified Purchase 5 out of 5 Edifier M206 B T It is lovely. The sound production is ok. Love it 30-08-2021 by R I C H I E Verified Purchase 4 out of 5cool It's wonderful", "If F M radio and remote control is integrated it will be superb! 30-08-2021 by Emmanuel Verified Purchase 5 out of 5 Good sound This sound is smooth, and nice design. ", "But my only concern is that there's no remote control. 30-08-2021 by samuel Verified Purchase 5 out of 5 Very Good sound Good sound 29-08-2021 by Abiola Verified Purchase 4 out of 5 Good Small but convenient 29-08-2021 by Paul Verified Purchase"], "66": [" 5 out of 5 I love it It’s a good product, the sound is okay, but they would have included cable to connect it to T V 29-08-2021 by Prince Adebayo Verified Purchase 5 out of 5 I like it Very good speaker 29-08-2021 by O L U M I D E Verified Purchase 5 out of 5 Nice Nice and has a good base 29-08-2021 by D A N D Y E M M A N U E L Verified Purchase 5 out of 5 I love it Just what I wanted, only that I thought it was a rechargeable one 28-08-2021 by A D E W A L E Verified Purchase 5 out of 5good What a good product 27-08-2021 by O L O S U N D E Verified Purchase 5 out of 5 I like it Works well, . The sound is good 26-08-2021 by O L U M I D E Verified Purchase 5 out of 5 Nice sound Nice sound 25-08-2021 by J O S H U A Verified Purchase 4 out of 5 I like it The quality match the price and the sound is okay 25-08-2021 by Akinee Verified Purchase 3 out of 5 I like it It's Ok 25-08-2021 by Ikechukwu Verified Purchase 4 out of 5edifier Would have loved it if it came with a remote 24-08-2021 by Iroghama Verified Purchase"], "67": [" 5 out of 5 Sound quality Increase your woofer sound quality 22-08-2021 by Patrick Rayne A Verified Purchase 4 out of 5not bad It can be more better if it can be remoted, i mean to make it more digital. 20-08-2021 by Abass bunmi Verified Purchase 5 out of 5 I like it This product worth it 20-08-2021 by Olawale Verified Purchase 4 out of 5mr It was ok 20-08-2021 by Mfeseer Verified Purchase 4 out of 5 I Like it It's been great so far. Perfect for a small room 20-08-2021 by D O L S Verified Purchase 5 out of 5 I love it Nice one 19-08-2021 by Ali Verified Purchase 5 out of 5powerful Excellent 18-08-2021 by agbaje Verified Purchase 4 out of 5sound check. okay! A remote will do fine 17-08-2021 by Charles Verified Purchase 4 out of 5 I like it so much Is good and loud 17-08-2021 by Adeyemi Verified Purchase 5 out of 5 Sounds great The sound superseded my expectations I love it 17-08-2021 by J E S S Verified Purchase"], "68": [" 5 out of 5 Value for money U can’t ask for more 15-08-2021 by Z U B A I R S I D D I Q U I Verified Purchase 5 out of 5 Super great pc speakers. love it! 15-08-2021 by Poko Verified Purchase 5 out of 5wonderful for the price. The sound quality was good. Bass is not exceptional but it'll do alright. Great for the price. 14-08-2021 by Oyeleye Verified Purchase 5 out of 5 Bass It has a nice bass 13-08-2021 by Pelumi Verified Purchase 5 out of 5 Nice Lacks remote but nice overall 13-08-2021 by C H R I S T I A N Verified Purchase 4 out of 5 I like it. The product is okay with the price, I love it and its working perfectly. . Thanks 13-08-2021 by Arc. Olatoyese Verified Purchase 5 out of 5 I like it The product is exactly how it was shown online 08-08-2021 by Sunday Verified Purchase 5 out of 5 I like it Very Good 31-07-2021 by Oladayo Verified Purchase 5 out of 5 I like it It’s awesome 30-07-2021 by oluwaferanmi Verified Purchase 5 out of 5 Awesome! Good sound it's all perfect for me it's fine. ♥️♥️♥️♥️♥️ 26-07-2021 by Paul Verified Purchase"], "69": [" 4 out of 5 Not Bad The sound quality is fair with the price, the only drawback is that it does not have a remote control. I find it a little difficult adjusting the volume etc without a remote control. Everything about it is just manually operated. It still beat many others within the price range in sound quality. 22-07-2021 by C H R I S T I A N Verified Purchase 1 out of 5 I don't like it The bass is horrible ", "I regret buying it 19-07-2021 by Harrison Verified Purchase 5 out of 5 Good sound Sound is great love it 19-07-2021 by L A W R E N C E I K E N N A Verified Purchase 5 out of 5 I love it The output is so madt plus bass is so on point. . . But I would've loved if it came with a remote control. . . ? ? 18-07-2021 by Joshua Verified Purchase 5 out of 5 I love it. It's superb. 16-07-2021 by Mahmud Verified Purchase 4 out of 5 I like it The product is okay 16-07-2021 by I S O L A R Verified Purchase 5 out of 5like itblasting it as I type, love it 15-07-2021 by Jonas Verified Purchase 5 out of 5 I love it I have being really enjoying jumia services ", "Always on time, ", "And i have not had any disappointment in any of the product delivered. Thanks Jumia 15-07-2021 by Ikofiz Verified Purchase 4 out of 5 I like it The bass is excellent. 15-07-2021 by Christian Verified Purchase 4 out of 5 Cute Clean sound 14-07-2021 by victor Verified Purchase"], "70": [" 5 out of 5 I like it This product is superb, the sound is great 11-07-2021 by Alfred Verified Purchase 4 out of 5 Cool product Nice sound output and cheap too. 11-07-2021 by B.Jay Verified Purchase 3 out of 5 Fair Enough It's got an Edifying Audio quality, for persons who enjoys indoor low volumed music 11-07-2021 by Ijeoma Verified Purchase 5 out of 5 Good Enough Great quality. I like it. 10-07-2021 by Edet Verified Purchase 5 out of 5 Great Sound output Sound quality is superb, the Bass is thundering. . . Nice product. Using it for my T V. This is theatre in its own. 09-07-2021 by B R E N Verified Purchase 5 out of 5 Loved it Good ? ? 08-07-2021 by David Verified Purchase 5 out of 5 I like it Good product 07-07-2021 by Odunayo Verified Purchase 4 out of 5like itthe sound production quality is very good 04-07-2021 by U G W U Verified Purchase 5 out of 5 I love it It's a really cool sound system. 02-07-2021 by Ayomide Verified Purchase 5 out of 5 I like it It's a good one, I love it 01-07-2021 by Hammed Verified Purchase"], "71": [" 5 out of 5 A W E S O M E Great sound, and easy to use. 30-06-2021 by R A P H A E L Verified Purchase 5 out of 5 G O O D P R O D U C T Sound amazing 28-06-2021 by O L U W A G B E M I G A Verified Purchase 5 out of 5very okay Good product 20-05-2021 by Olawumi Verified Purchase 4 out of 5ok Is ok but they should improve on the bass 09-05-2021 by N W A O K E T E Verified Purchase"]}